docs/example1.xml

<?xml version="1.0"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:car="http://www.enova.net">
  <soap:Header/>
  <soap:Body>
    <car:Meldedaten>
      <!--Optional:-->
      <car:meldedatenstring><![CDATA[<?xml version="1.0" encoding="utf-8"?>
<gemeinde oestat="99999" version="5">
<Logindaten>
<user>Zimmer_gerasdorf</user>
<mandant>genusscard</mandant>
<passwort>xxxxxxxxxx</passwort>
</Logindaten>
<betrieb betriebnr="1501">
<meldeblatt mblattnr="11001" ankunft="2019-10-08" abreise="" bearbeiter="enova" bemerkung=""
aufenthalte="3" abgeplant="2019-10-11" reisegruppe="0">
<landschl lschlnr="14" anzpers="1"/>
<gastart gastart="P" anzpers="1"/>
<gast gastlfdnr="1" gasttyp="HG" anrede="Fr." vorname="Marie" name="Antoinette"
strasse="Teststrasse" strasse2="" pobox="" nation="F" plz="1234" ort="Paris" ortzusatz=""
gebdatum="1900-01-01" geschlecht="2" reisedokument="" staatsang="A" herkunftsland="14" beruf=""
berufssparte="" email="" telefon="" zusatztext="" gaesteart="P"/>
</meldeblatt>
</betrieb>
</gemeinde>
]]></car:meldedatenstring>
    </car:Meldedaten>
  </soap:Body>
</soap:Envelope>

